---
type: AreaCreationData
namespace: Autodesk.Revit.Creation
version: 2024
members: 2
tags: [revit-api, class]
---

# AreaCreationData

`Autodesk.Revit.Creation.AreaCreationData` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AreaCreationData | — | `` |
| Property | TagPoint | — | `public UV TagPoint { get ; set ; }` |